       01      1-MVMNTS.
         05    1-MV-CLI-CODE            PIC X(5).
         05    1-MV-COMPTE-NUM          PIC X(6).
         05    1-MV-ECRITURE-NUM        PIC X(5).
         05    1-MV-ECRITURE-DATE       PIC X(8).
         05    1-MV-COMPTE-LIBELLE      PIC X(35).
         05    1-MV-SENS-ECRITURE       PIC A(1).
         05    1-MV-MONTANT             PIC 9(16)V99.
         05    FILLER                   PIC X(2).
